app/controllers/events_controller.rb

  def create
    @event = current_user.events.build(event_params)
        respond_to do |format|
            if @event.save
---
INSERT INTO "events" ("created_at", "end_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 26 Sep 2013 07:39:06 UTC +00:00], ["end_at", Thu, 26 Sep 2013 00:00:00 UTC +00:00], ["name", "Today"], ["updated_at", Thu, 26 Sep 2013 07:39:06 UTC +00:00], ["user_id", 4]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "start_at" = ?, "end_at" = ?, "color" = ?, "updated_at" = ? WHERE "events"."id" = 101  [["start_at", Tue, 01 Oct 2013 00:00:00 UTC +00:00], ["end_at", Tue, 24 Sep 2013 00:50:00 UTC +00:00], ["color", "#5CCCCC"], ["updated_at", Fri, 27 Sep 2013 17:45:39 UTC +00:00]]

  def show
    @event = current_user.events.find_by(id: params[:id]) || current_user.shared_events.find(params[:id])
    @owner = User.find(@event.user_id)
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = 1 LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

    def set_event
      # Get only current user events
      @event = current_user.events.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT 1  [["user_id", 2], ["id", "1"]]